Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
a= [4,8,15,16,23,42]

In [4]:
Series = pd.Series(a)

In [5]:
print(Series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
VAR = ['apple', 'ball', 'cat', 1,2,3,4,5,6,7]

In [7]:
VAR_series= pd.Series(VAR)

In [8]:
print(VAR_series)

0    apple
1     ball
2      cat
3        1
4        2
5        3
6        4
7        5
8        6
9        7
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
Dict_1 = {"Name": ["Alice", "Bob", "Claire"],"Age": [25,30,27], "Gender": ["Female", "Male", "Female"] }

In [14]:
A= pd.DataFrame(Dict_1)

In [15]:
A

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ANS: 
In Pandas, a DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns). It is essentially a collection of Pandas Series where each column of the DataFrame is a Series. The key difference between a DataFrame and a Series is that a DataFrame can have multiple columns, whereas a Series is a one-dimensional array.

In [16]:
#for example see above code of series 
print(Series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [17]:
#for example see above code of Data frame
A

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ANS: there are many functions to manipulate data in dataframe, some key functions are
head(), tail(), info(), describe(), shape, columns, drop(), groupby(), merge() etc.

In [21]:
#examples 
A.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
A.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [23]:
A.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [24]:
A.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [25]:
A.shape

(3, 3)

In [26]:
A.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [27]:
A.loc[0]

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ANS:
Series: It is mutable. You can modify the values in a Series after it has been created.

DataFrame: It is mutable as well. You can add, remove, or modify columns, and you can modify the data within the columns.

Panel: Panel is also mutable but not used till now.
So, in summary, both Series and DataFrame are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
#ANS:
# Creating Pandas Series
age = pd.Series([25, 30, 22, 35])
salary = pd.Series([50000, 60000, 45000, 75000])
city = pd.Series(['Ahmedabad', 'Mumbai', 'Chandigarh', 'Bangalore'])

# Creating a DataFrame using the Series
df = pd.DataFrame({'Age': age, 'Salary': salary, 'City': city})

In [35]:
df

   Age  Salary        City
0   25   50000   Ahmedabad
1   30   60000      Mumbai
2   22   45000  Chandigarh
3   35   75000   Bangalore